/*

Зачем нам нужен и как работает event loop?


---------------------------------------------------------------------------------------------

 Как мы работаем с асинхронным кодом?


---------------------------------------------------------------------------------------------

 Сталкивался ли ты c shadow dom?


---------------------------------------------------------------------------------------------



---------------------------------------------------------------------------------------------

 Зачем нам нужен DOM?

 DOM (Document Object Model, объектная модель документа) — это программный интерфейс к HTML-документам. Этот интерфейс позволяет воздействовать на документ из скриптов, меняя его оформление, стили, содержимое. В DOM документ представлен в виде дерева узлов.


---------------------------------------------------------------------------------------------

 Что такое и зачем нужен virtual DOM?


---------------------------------------------------------------------------------------------

 Как работают события?



---------------------------------------------------------------------------------------------
*/