//     HTML
//
// 00:03:10 Что такое HTML, JS и CSS?
// 00:04:00 Какие основные вещи присущи HTML?
// 00:05:24 Какие ты знаешь базовые HTML теги?
// 00:07:08 В чем смысл таких тегов как section, header?
// 00:07:28 Почему мы не можем вместо тегов section и header использовать обычный div?
// 00:07:46 Будет ли разница для конечного пользователя в разных тегах?
// 00:09:21 Характеристика HTML которая говорит о том как можно использовать разные теги для конкретных ситуаций?
// 00:10:13 Чем семантика отличается от доступности(a11y)?
// 00:10:20 Что ты знаешь про доступность? Доводилось ли улучшать доступность сайта?
//
//     CSS
//
// 00:11:15 Почему плохо писать все стили в одном файле или style?
// 00:12:15 В чем отличия разных подходов подключения стилей?
// 00:13:41 Как расшифровывается аббревиатура CSS?
// 00:14:00 Как ты понимаешь что такое каскад?
// 00:14:42 Как работает наследование в CSS?
// 00:15:56 Способы изоляции стилей в CSS?
// 00:16:53 Какие знаешь подходы по написанию CSS?
// 00:18:23 Решают ли БЭМ и scoped стили проблему наследования стилей?
// 00:20:20 Специфичность в CSS
// 00:21:50 Как в CSS работают разные приоритеты стилей?
// 00:29:30 Про схлопывание отступов
// 00:30:48 Использовал ли ты media запросы?
// 00:31:04 Что такое адаптивная верстка?
// 00:31:20 Какими параметрами нужно манипулировать чтобы адаптировать сайт?
// 00:32:12 Как ты знаешь подходы по созданию адаптивных сайтов?
// 00:32:48 В чем отличие адаптивного дизайна от отзывчивого?
//
//     JS
//
// 00:34:25 Какие типы данных есть в JS?
// 00:36:39 Какой тип у функции?
// 00:36:55 Чем похожи массивы, объекты и функции?
// 00:37:35 Какие есть операторы в JS?
// 00:39:24 Какие есть операторы сравнения?
// 00:46:13 Какие есть типы написания переменных?
// 00:51:00 Что такое замыкание?
// 00:55:00 Классическая задача на замыкание
// 01:02:47 Знаешь ли что такое event loop?
//
//     Web API
//
// 01:04:10 Что такое делегирование?
// 01:04:51 Что такое событийная модель в браузере?
// 01:11:13 Всплытие событий
//
//
//
// https://www.youtube.com/watch?v=Blxset-yW8Y&list=PLGePdqSd3VuXHqV3i7Jjtey-OMSvjitoM&index=2
//     JS
// 00:06:15 Какие типы данных ты знаешь?
//
// 00:07:30 Чем отличается null и undefined?
//
// 00:08:55 Чем отличаются друг от друга унарные, бинарные и тернарные операторы?
//
// 00:09:55 В чем есть особенность у логических операторы?
//
// 00:12:00 В чем особенность выполнения логического "И"
//
// 00:12:58 В чем отличие операторов сравнения?
//
// 00:14:25 Какие есть falsy значения?
//
// 00:17:00 Что такое выражение? Staitment - операция / выражение - возвращает всегда какое-то значение, так же как и сравнение
//
// 00:19:20 Что такое function expression и function declaration?
//
// 00:22:20 Что такое функция первого рода?
//
// 00:23:15 Что такое рекурсия?
// Это когда мы передаем в параметр функцию и вызываем ее внутри самой функции. Она обязательно должна заканчиваться, чтобы не уйти в бесконечность
//
// 00:27:30 Что такое Promise?
//
//     Web API & HTML
//
// 00:38:15 Что такое DOM?
// 00:40:40 Что за событие DOM Content Loaded?
// 00:45:20 Что такое doctype?
// 00:46:00 Что такое data атрибуты?
// 00:50:10Что такое и зачем нужна семантика?
// 00:56:05 Как работает HTML форма и что нужно чтобы ее отправить?
// 01:10:10 Как закрыть модалку по клику вне нее?
// 01:12:20 Как ты стилизуешь чекбоксы, инпуты etc?
// 01:14:00 Возвращаемся к закрытию модалки вне нее
// 01:19:10 Почему нам нужно отписываться от обработчиков?
//
//     HTTP
//
// 01:20:10 В чем разница между GET и POST?
// 01:27:00 Что такое и зачем нужен Ajax?
// 01:27:55 Как мы жили до Ajax?
// 01:30:00 Зачем нужен REST?
// 01:31:40 Какой будет запрос для подтверждения регистрации пользователя?
// 01:35:30 Что такое Cookies?
// 01:43:10 Как мы можем защитить Cookies?
// 01:47:30 Чем отличается http от https?
// 01:50:20 Можем ли мы запустить http2 без https?
//
//


//
//
//
// https://www.youtube.com/watch?v=ScRTey_dvhI&list=PLGePdqSd3VuXHqV3i7Jjtey-OMSvjitoM&index=5
//
// ПОСМОТРЕТЬ
//     JS
//
// 00:17:40 Какие у нас существуют функции в JS?
// 00:20:00 В чем разница между function expression и function declaration?
// 00:24:25 Откуда берется контекст у функции?
// 00:25:40 Что такое чистая функция?
// 00:26:45 Как мы можем изменить контекст у функции?
// 00:29:00 Что такое eval и почему его следует избегать?
// 00:31:30 Чем область видимости отличается от контекста?
// 00:32:50 Что такое замыкание?
// 00:34:00 Как работают модули в ES modules?
// 00:36:30 Можем ли мы поменять переменную в модуле извне?
// 00:38:50 Как мы можем эмулировать модули не используя ES modules/require?
// 00:42:30 Откуда берется свойство length у массива?
//
//     Web API
//
// 00:48:20 Зачем нам нужен и как работает event loop?
// 00:55:00 Как мы работаем с асинхронным кодом?
// 00:58:30 Сталкивался ли ты c shadow dom?
//
//     HTML
//
// 01:04:50 Сколько нужно тегов чтобы собрать html страницу?
// 01:11:30 Как мы можем структурировать html страницу?
// 01:16:20 Можем ли мы использовать h1 несколько раз на странице?
// 01:18:20 Как проверить правильную иерархию html заголовков?
// 01:20:00 Как мы можем семантически разделять контент на странице?
// 01:23:40 Приходилось ли тебе верстать табличное представление данных?
// 01:27:30 Необязательные теги в html таблице?
// 01:31:15 Проблема адаптации таблицы?
// 01:33:30 Зачем нужно указывать ширину и высоту для картинок?
// 01:37:55 Какие форматы изображений ты знаешь?
// 01:40:45 Слышал ли ты о webp?
// 01:41:50 Как мы можем сделать webp с фолбеком?
// 01:45:30 Как мы можем вставить svg в документ?
// 01:49:00 Приходилось ли использовать iframe?
//
//     CSS
//
// 01:53:20 Какие есть способы изоляции в CSS?

//
// https://www.youtube.com/watch?v=EaTZXKlpsj0&list=PLGePdqSd3VuXHqV3i7Jjtey-OMSvjitoM&index=6
//
//     HTML
//
// 00:12:00 Зачем нам столько разных тегов?
// 00:15:00 Можем ли мы использовать тег header в нескольких местах?
// 00:17:37 В чем различие article и section?
// 00:19:40 Когда нужно использовать кнопки а когда ссылки?
// 00:21:45 В чем разница между тегами b и strong?
// 00:25:40 Откуда тег b или strong берут свою "жирность"?
// 00:26:20 Как устроена работа с формами?
// 00:29:55 Можем ли мы не использовать html формы?
//
//     CSS
//
// 00:32:00 Какие есть единицы измерения в CSS?
// 00:38:40 Когда брать абсолютные величины а когда относительные?
// 00:42:35 Какие есть варианты указания цвета и зачем нам столько?
// 00:45:00 Какие есть способы модификации цвета?
// 00:49:50 Особенности свойства color?
// 00:53:10 Доступность цвета
// 00:56:40 Псевдоэлементы
// 01:01:10 Приходилось ли делать кастомизацию форм?
// 01:06:10 Зачем нам нужен autoprefixer?
// 01:09:30 Как автопрефиксер понимает где поставить префиксы?
// 01:11:10 Как выбирать свойство основываясь на поддержке браузерами?
//
//     JS
//
// 01:16:45 Какие ты использовал типы переменных?
// 01:23:40 В чем отличие null и undefined?
// 01:26:20 Логические операторы
// 01:28:50 Особенности оператора &&
// 01:30:40 Различие операторов сравнения
// 01:32:50 Какие есть falsy значения?
// 01:35:10 Какие ты знаешь типы функций?
// 01:36:30 Зачем нам нужны стрелочные функции?
// 01:37:40 Как появляется контекст у функции?
// 01:38:40 Что такое чистая функция?
// 01:43:35 Чем отличается синхронный код от асинхронного?
//
//     Web API
//
// 01:49:55 Зачем нам нужен DOM?
// 01:55:20 Что такое и зачем нужен virtual DOM?
// 02:00:10 Как работают события?



//
// https://www.youtube.com/watch?v=d5weK2w1V4A&list=PLGePdqSd3VuXHqV3i7Jjtey-OMSvjitoM&index=7
//
// JS
//
// 00:06:10 Способы объявления переменных (var, let, const)
// 00:11:20 Мутабельные и имутабельные типы данных
// 00:21:30 Операторы сравнения
// 00:29:50 Что такое контекст в функции?
// 00:38:20 Отличие синхронного от асинхронного кода
// 00:46:50 Задача с цепочкой промисов




///////////////////////////// ПОЛЗУНКОВ


// https://www.youtube.com/watch?v=8Xuftz2IiAI&list=PL0k-9Y7O1GwfBJikWB5xRgKxegivxFNsY
//
// 00:01:59 Расскажи о себе
// 00:07:19 Как учил JS
// 00:11:59 Проходил ли курсы, что читал?
// 00:12:53 Изучал ли браузерный js
// 00:14:22 Какие планы на будущее
// 00:17:34 Используешь ли BEM
// 00:19:27 Чем собираешь проекты
// 00:20:11 Верстка под что-то экзотическое
// 00:21:27 Опыт работы с анимациями
// 00:22:36 Что такое тернарный оператор
// 00:27:50 Разница между Array.forEach и Array.map
// 00:31:54 Про псевдомассив arguments
// 00:34:02 Про typeof function
// 00:35:11 Как проверить что в переменной массив
// 00:36:06 Про parseFloat
// 00:36:34 Про Array.indexOf
// 00:36:51 Про Array.includes
// 00:37:12 Про onClick
// 00:37:57 Как удалить eventListener
// 00:39:19 Как передвигаться вперед/назад по истории
// 00:40:00 Как получить текущий URL страницы
// 00:40:52 Как средиректить пользователя на URL
// 00:41:22 В чем разница между spread и rest операторами
// 00:44:02 Про rest оператор
// 00:47:03 Что такое деструктуризация
// 00:51:10 Для чего нужен Promose.all
// 00:52:59 Задача про счастливые числа
// 01:04:07 Задача про url параметры
// 01:24:56 Как поставить cookie в браузере




//
// https://www.youtube.com/watch?v=ktdN2upYX1I&list=PL0k-9Y7O1GwfBJikWB5xRgKxegivxFNsY&index=2
//
//
// 00:09:44 Какие значения свойства display знаешь
// 00:11:49 Как повернуть элемент на 45 градусов
// 00:12:29 В чем разница между flex и grid
// 00:15:25 Как сделать сайт responsive
// 00:16:32 Чем em отличается от rem
// 00:17:15 Как сделать, чтобы изображения на мобильных грузилась маленькая
// 00:19:04 Как проверить, что переменная NaN
// 00:20:01 Как проверить, что число целое
// 00:24:41 Разница между function declaration и function expression
// 00:26:07 Как поменять значения двух переменных местами
// 00:27:47 Разница между == и ===
// 00:28:21 Задания на приведение типов
// 00:31:30 Разница между slice и splice
// 00:34:21 Как отсортировать массив чисел по возрастанию
// 00:36:25 Переписать конструктор на ES6 синтаксис
// 00:40:41 Как узнать, что объект пустой
// 00:42:39 Сделать первую букву строки заглавной
// 00:48:38 Что делает метов freeze
// 00:51:26 Как инвертировать порядок элементов массива
// 00:51:52 Найти max и min значения в массиве
// 00:58:52 Spread оператор со строкой
// 00:59:43 Получить символ из строки по index
// 01:02:04 Как получить массив уникальных элементов
// 01:03:56 Как очистить массив от всех элементов
// 01:05:30 Как отсортировать в массиве только нечетные числа



//
// https://www.youtube.com/watch?v=lrdaRbJctaA&list=PL0k-9Y7O1GwfBJikWB5xRgKxegivxFNsY&index=3
//
// 00:10:04 Когда лучше использовать id а когда class
// 00:13:06 В чем разница стилей с селектором id и класса
// 00:13:41 Различные виды позиционирования элементов
// 00:16:52 Какие свойства media отличные от screen знаешь
// 00:18:54 Flash of Unstyled Content
// 00:25:56 Как можно сверстать стрелочку
// 00:28:24 В чем разница между == и === в js
// 00:29:27 Как удалить обработчик события
// 00:30:21 Про return из функции
// 00:32:49 Про изменение ссылки на объект
// 00:36:54 Пересечение массивов (простой вариант задачи)
// 00:41:16 Какие бывают  состояния у Promise
// 00:42:48 Задача про var и setTimeout
// 00:46:43 Разница между Object.getOwnPropertyNames и Object.keys
// 00:50:26 При клике на кнопку нужно удалить кнопку и отрисовать 2 новых
// 01:03:11 Про arrow function и обработчик события
// 01:09:02 Про this внутри arrow function
// 01:13:20 Чем отличаются PUT и POST запросы
// 01:14:38 Для чего нужен package-lock.json
// 01:18:42 Что такое staging area в git
// 01:20:11 В чем разница между merge и rebase
// 01:23:12 Какие pet project’ы делала




//
// https://www.youtube.com/watch?v=wP7XVriACtA&list=PL0k-9Y7O1GwfBJikWB5xRgKxegivxFNsY&index=4
//
// 00:14:16 Подключении скриптов через script
// 00:20:06 Что такое всплытие событий
// 00:22:21 stopPropagation/preventDefault
// 00:24:46 Какие типы данных есть в JS
// 00:25:51 Способы итерации по массивам
// 00:27:11 Разница между for и froEach
// 00:31:49 Чем forEach отличается от map
// 00:32:49 Метод reduce
// 00:33:51 delete элемента массива
// 00:36:44 Разница между Func() и new Func()
// 00:38:45 Как скопировать простой объект
// 00:39:39 Изоморфная функция добавления
// 00:43:59 Функция возвращающая расширение файла
// 00:48:52 Задача про глубину DOM дерева
// 01:01:02 Способы уменьшения времени загрузки страницы
// 01:03:29 В чем плюсы SSR
// 01:04:59 Способы уменьшения времени загрузки страницы
// 01:08:59 HTTP заголовки кеширования
// 01:10:45 Cookies
// 01:11:46 Security поля в cookie




//
// https://www.youtube.com/watch?v=BOCkaqdbdCg&list=PL0k-9Y7O1GwfBJikWB5xRgKxegivxFNsY&index=5
//
// 00:06:58 Верстка - про специфичность селекторов
// 00:11:25 Для чего явно задавать картинкам размеры
// 00:13:48 В чем разница между div и span
// 00:14:34 Что такое inline-block
// 00:15:30 Про схлопывание отступов
// 00:19:20 Сверстать горизонтальное меню
// 00:23:04 Про inline-block и проблему с пробелами
// 00:27:56 Что такое this в JS
// 00:30:20 use strict и this
// 00:30:59 Разница между null и undefined
// 00:32:46 Как проверить что объект это массив
// 00:35:18 Про логические операторы && и ||
// 00:38:55 Разница меджу function expression и function declaration
// 00:40:13 IIFE
// 00:43:23 Написать функцию duplicate([1,2])
// 00:45:17 Про делегирование событий
// 00:51:06 Передача значений по ссылке
// 00:52:15 Метод filter и остаток от деления
// 00:53:12 Унарный оператор инкремента
// 00:53:43 Числа с плавающей точкой
// 00:55:09 Сравнение объектов
// 00:55:42 bind и аргументы
// 00:58:01 Скоуп переменных
// 00:58:58 localStorage, sessionStorage и cookies


//                МИДЛ
//
// https://www.youtube.com/watch?v=HCXDrVikPGk&list=PL0k-9Y7O1GwfBJikWB5xRgKxegivxFNsY&index=6
//
// 00:16:55 Про хойстинг в JS
// 00:20:11 Про let, var, const
//     00:21:31 Про замыкания и IIFE
// 00:28:08 Про контекст вызова, arrow function, bind
// 00:32:33 Про передачу аргументов через bind
// 00:35:00 Задача про фрукты (массивы, объекты, sort)
// 00:56:10 Про arguments и rest
// 00:58:22 Про каррирование
// 00:59:47 Про каррирование и рекурсию
// 01:03:15 Про High order functions и карриррование
// 01:07:26 Про event loop и setTimeout
// 01:08:23 Что такое CORS
// 01:10:07 HTTP запрос OPTIONS
// 01:10:59 Что такое CDN
// 01:12:26 Про отдельные домены для статики






//
// ЗАДАЧИ С СОБЕСЕДОВАНИЯ РЕШЕНИЯ ПОЛЗУНКОВ
//
//
// https://www.youtube.com/watch?v=2Od3MV1-mpk&list=PL0k-9Y7O1GwccXKHRzmvVj17yB7T9pjTo

//
// Материалы для пэт проектов
//
//
// https://www.youtube.com/watch?v=rVEZYrC1w4I&list=PL0k-9Y7O1GwelFWraYtGuVPT7tgu1oPoO





//
// ULBI - ТИМУР
//
// АЛГОРИТМЫ И СТРУКТУРЫ ДАННЫХ
// https://www.youtube.com/watch?v=NErrGZ64OdE&list=RDCMUCDzGdB9TTgFm8jRXn1tBdoA&index=5
// //
// EVENT LOOP
// https://www.youtube.com/watch?v=377qAu37OTE&list=RDCMUCDzGdB9TTgFm8jRXn1tBdoA&index=7
// // //
// https://www.youtube.com/watch?v=G7pAP1TvZSw

//
// ВОПРОСЫ СОБЕСЕДОВАНИЙ ULBI
//
// https://www.youtube.com/watch?v=gV6eobXisYU

// CSS

// https://www.youtube.com/watch?v=4YRG6cMAASI&list=RDCMUCDzGdB9TTgFm8jRXn1tBdoA&index=2



// Собеседование junior frontend react разработчика.
//
//
// https://www.youtube.com/watch?v=jf5TkGzWqiM&list=RDCMUCDzGdB9TTgFm8jRXn1tBdoA&index=4

