/*

Вопрос: Чему равно foo?

var foo = 10 + '20';

---------------------------------------------------------------------------------------------

Вопрос: Что выводит код ниже?

console.log(0.1 + 0.2 == 0.3);

---------------------------------------------------------------------------------------------

Вопрос: Как сделать, чтобы это выражение работало?

add(2, 5); // 7
add(2)(5); // 7


---------------------------------------------------------------------------------------------

Вопрос: Какое значение возвращает данное выражение?

"i'm a lasagna hog".split("").reverse().join("");


---------------------------------------------------------------------------------------------

Вопрос: Чему равно window.foo?

( window.foo || ( window.foo = "bar" ) );


---------------------------------------------------------------------------------------------

Вопрос: Что покажут эти два alert?

var foo = "Hello";
(function() {
  var bar = " World";
  alert(foo + bar);
})();
alert(foo + bar);


---------------------------------------------------------------------------------------------

Вопрос: Чему равно foo.length?

var foo = [];
foo.push(1);
foo.push(2);


---------------------------------------------------------------------------------------------

Вопрос: Чему равно foo.x?

var foo = {n: 1};
var bar = foo;
foo.x = foo = {n: 2};


---------------------------------------------------------------------------------------------

Вопрос: Что выводит код ниже?

console.log('one');
setTimeout(function() {
  console.log('two');
}, 0);
console.log('three');


---------------------------------------------------------------------------------------------

Вопрос: В чем разница между этими четырьмя промисами (promises)?

doSomething().then(function () {
  return doSomethingElse();
});

doSomething().then(function () {
  doSomethingElse();
});

doSomething().then(doSomethingElse());

doSomething().then(doSomethingElse);

---------------------------------------------------------------------------------------------
В чем разница между: function Person(){}, var person = Person(), и var person = new Person()?


---------------------------------------------------------------------------------------------


Сделайте так, чтобы этот код работал:
duplicate([1,2,3,4,5]); // [1,2,3,4,5,1,2,3,4,5]

---------------------------------------------------------------------------------------------
Напишите цикл, который перебирает числа до 100, возвращая “fizz” на числа кратные 3, “buzz” на числа кратные 5 и “fizzbuzz” на числа кратные 3 и 5



---------------------------------------------------------------------------------------------
Объясните разницу при использовании foo в function foo() {} и var foo = function() {}

---------------------------------------------------------------------------------------------
Можете ли вы привести пример деструктуризации объекта или массива?

---------------------------------------------------------------------------------------------
Шаблонные строки в ES6 намного упрощают создание строк, можете ли вы привести пример их использования?

---------------------------------------------------------------------------------------------
Можете ли вы привести пример каррированной функции (curry function) и в чём их преимущество?

---------------------------------------------------------------------------------------------


---------------------------------------------------------------------------------------------
 */